Repository: katastrophiee/VotingSystem
Catalog: Resources/API/Providers/AdminProvider.*.resx
Languages: fr

# VoterNotCandidate
source: Voter Not A Candidate
fr: Client Non Candidat

# VoterNotCandidateWithId
source: This voter is not a candidate with the voter id
fr: Ce client n’est pas un candidat avec l’id

source: Internal Server Error
fr: Erreur Interne du Serveur

# InternalServerErrorAddElection
source: An unknown error occured when trying to add a new election for admin
fr: Une erreur inconnue s’est produite lors de la tentative d’ajout d’une nouvelle élection pour l’administrateur

# InternalServerErrorAdminVerifyId
source: An unknown error occured when trying to verify ID for admin
fr: Une erreur inconnue s’est produite lors de la tentative de vérification de l’ID pour l’administrateur

# InternalServerErrorGetCandidate
source: An unknown error occured when trying to retrieve candidate for admin
fr: Une erreur inconnue s’est produite lors de la tentative de récupération du candidat pour l’administrateur

# InternalServerErrorGetVoterDetails
source: An unknown error occured when trying to retrieve voter details for admin
fr: Une erreur inconnue s’est produite lors de la tentative de récupération des détails du client pour l’administrateur

# InternalServerErrorGetVoters
source: An unknown error occured when trying to retrieve voters for admin
fr: Une erreur inconnue s’est produite lors de la tentative de récupération des clients pour l’administrateur

source: No Voter Found
fr: Aucun Client Trouvé

# NoVoterFoundWithId
source: No voter found with the voter id
fr: Aucun client n’a été trouvé avec l’id

source: No Document Found
fr: Aucun Document Trouvé

# NoDocumentFoundWithId
source: No document was found with the document id
fr: Aucun document n’a été trouvé avec l’id

source: Invalid Start Or End Date
fr: Date de début ou de fin invalide

# InvalidStartOrEndDateWithId
source: Invalid start or end date for admin id
fr: Date de début ou de fin invalide pour l’identifiant admin

source: No Election Description
fr: Pas de description d’élection

# NoElectionDescriptionWithId
source: No election description was provided when trying to add election for admin
fr: Aucune description d’élection n’a été fournie lors de la tentative d’ajout d’une élection pour l’administrateur

source: No Election Name
fr: Pas de nom d’élection

# NoElectionNameWithId
source: No election name was provided when trying to add election for admin
fr: Aucun nom d’élection n’a été fourni lors de la tentative d’ajout d’une élection pour l’administrateur

source: No Election Options
fr: Pas d’options d’élection

# NoElectionOptionsWithId
source: No election options were provided when trying to add election for admin
fr: Aucune option d’élection n’a été fournie lors de la tentative d’ajout d’une élection pour l’administrateur

# InternalServerErrorAddTask
source: An unknown error occured when trying to add task for admin id
fr: Une erreur inconnue s’est produite lors de la tentative d’ajouter une tâche pour l’id d’administrateur

# InternalServerErrorDeleteTask
source: An unknown error occured when trying to delete task with id
fr: Une erreur inconnue s’est produite lors de la tentative de supprimer la tâche avec id

# InternalServerErrorGetAdmin
source: An unknown error occured when trying to admin with id
fr: Une erreur inconnue s’est produite lors de la tentative d’administrer avec id

# InternalServerErrorGetAdmins
source: An unknown error occured when trying to admins for admin id
fr: Une erreur inconnue s’est produite lors de la tentative d’administrateurs pour l’id d’administrateur

# InternalServerErrorGetTask
source: An unknown error occured when trying to get task with id
fr: Une erreur inconnue s’est produite lors de la tentative d’obtenir une tâche avec id

# InternalServerErrorGetTasks
source: An unknown error occured when trying to get tasks for admin id
fr: ne erreur inconnue s’est produite lors de la tentative d’obtenir des tâches pour l’id d’administrateur

# InternalServerErrorUpdateAdmin
source: An unknown error occured when trying to update admin with id
fr: Une erreur inconnue s’est produite lors de la tentative de mise à jour de l’administrateur avec id

# InternalServerErrorUpdateTask
source: An unknown error occured when trying to update task with id
fr: Une erreur inconnue s’est produite lors de la tentative de mise à jour de la tâche avec id

source: No Task Found
fr: Aucune tâche trouvée

# NoTaskFoundWithId
source: No task was found with the task id
fr: Aucune tâche n’a été trouvée avec l’id de la tâche

source: No Admin Found
fr: Aucun Administrateur Trouvé

# NoAdminFoundWithId
source: No admin was found with the admin id
fr: Aucun administrateur n’a été trouvé avec l’id d’administrateur
