Repository: katastrophiee/VotingSystem
Catalog: Resources/API/Providers/VoterProvider.*.resx
Languages: es, fr

source: Voter Not Verified
es: Cliente No Verificado
fr: Client Non Vérifié

# VoterNotVerifiedWithId
source: Cannot convert user to candidate as they are not verified for user
es: No se puede convertir al usuario en candidato ya que no está verificado para el usuario
fr: Impossible de convertir l’utilisateur en candidat car il n’est pas vérifié pour l’utilisateur

source: Internal Server Error
es: Error Interno del Servidor
fr: Erreur Interne du Serveur

# InternalServerErrorGetActiveCandidates
source: An unknown error occured when trying to retrieve candidates for voter
es: Ocurrió un error desconocido al intentar recuperar candidatos para el cliente
fr: Une erreur inconnue s’est produite lors de la tentative de récupération des candidats pour le client

# InternalServerErrorGetCandidate
source: An unknown error occured when trying to retrieve candidate for voter
es: Ocurrió un error desconocido al intentar recuperar al candidato para el cliente
fr: Une erreur inconnue s’est produite lors de la tentative de récupération du candidat pour le client

# InternalServerErrorGetVoterAccountDetails
source: An unknown error occured when trying to retrieve voter
es: Ocurrió un error desconocido al intentar recuperar al cliente
fr: Une erreur inconnue s’est produite lors de la tentative de récupération du client

# InternalServerErrorGetInPersonVotingEligibility
source: An unknown error occured when trying to retrieve voter eligibility for voter id
es: Ocurrió un error desconocido al intentar recuperar la elegibilidad del votante para la identificación del votante
fr: Une erreur inconnue s’est produite lors de la tentative de récupération de l’éligibilité de l’électeur pour l’identifiant de l’électeur

# InternalServerErrorMakeVoterACandidate
source: An unknown error occured when trying to convert to candidate for voter
es: Ocurrió un error desconocido al intentar convertir al cliente en candidato
fr: Une erreur inconnue s’est produite lors de la tentative de conversion en candidat pour le client

# InternalServerErrorPutUpdateVoterProfile
source: An unknown error occured when trying to update profile for voter
es: Ocurrió un error desconocido al intentar actualizar el perfil para el cliente
fr: Une erreur inconnue s’est produite lors de la tentative de mise à jour du profil pour le client

# InternalServerErrorUpdateCandidate
source: An unknown error occured when trying to update candidate
es: Ocurrió un error desconocido al intentar actualizar al candidato
fr: Une erreur inconnue s’est produite lors de la tentative de mise à jour du candidat

source: No Candidate Found
es: No Se Encontró Candidato
fr: Aucun Candidat Trouvé

# NoCandidateFoundWithId
source: No candidate was found with the voter id
es: No se encontró un candidato con el id de cliente
fr: Aucun candidat n’a été trouvé avec l’id du client

source: No Voter Found
es: No Se Encontró Cliente
fr: Aucun Client Trouvé

# NoVoterFoundWithId
source: No voter found with the voter id
es: No se encontró un cliente con el id de cliente
fr: Aucun client n’a été trouvé avec l’id du client

source: No Name or Description Provided
es: No Se Proporcionó Nombre o Descripción
fr: Aucun Nom ou Description Fourni

# NoNameOrDescriptionProvidedWithId
source: No candidate name or description was provided when trying convert to candidate for voter id
fr: Aucun nom ou description de candidat n’a été fourni lors de la tentative de conversion en candidat pour l’id du client

# NoNameOrDescriptionProvidedUpdateWithId
source: No candidate name or description was provided when trying update candidate
es: No se proporcionó un nombre o descripción de candidato al intentar actualizar al candidato
fr: Aucun nom ou description de candidat n’a été fourni lors de la tentative de mise à jour du candidat

source: User Not Active
es: Usuario no activo
fr: Utilisateur non actif

# UserNotActiveWithId
source: You are not active to vote for voter id
es: No estás activo para votar por la identificación del votante
fr: Vous n’êtes pas actif pour voter pour l’identifiant de l’électeur

source: User Not Verified
es: Usuario no verificado
fr: Utilisateur non vérifié

# UserNotVerifiedWithId
source: You are not verified to vote for the voter id
es: No estás verificado para votar por la identificación del votante
fr: Vous n’êtes pas vérifié pour voter pour l’identifiant de l’électeur

source: No Roles Found
es: No se encontraron roles
fr: Aucun rôle trouvé

# NoRolesFoundWithId
source: No roles found for voter id
es: No se encontraron roles para la identificación del votante
fr: Aucun rôle trouvé pour l’identifiant de l’électeur

# InternalServerErrorRevokeCandidacy
source: An unknown error occured when trying to revoke candidacy for voter
fr: Une erreur inconnue s’est produite lors de la tentative de révocation de la candidature pour électeur
